---
kind: other
id: Methods.T:Autodesk.Revit.DB.Plumbing.PipeInsulationType
source: html/1ffa305c-538a-d067-4538-7ba166496b8b.htm
---
# PipeInsulationType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.